---
kind: type
id: T:Autodesk.Revit.DB.FillPatternTarget
source: html/1ad95fb2-c693-47b3-e826-c726fd1a09b9.htm
---
# Autodesk.Revit.DB.FillPatternTarget

The type of the fill pattern.

## Syntax (C#)
```csharp
public enum FillPatternTarget
```